driver-tests/iepse/usecases/RfidTheftDetection/jbi/test/RfidTheftDetection/location.xml

<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/"
                   xmlns:xsi="http://www.w3.org/1999/XMLSchema-instance"
                   xmlns:xsd="http://www.w3.org/1999/XMLSchema"
                   xmlns="RfidTheftDetection_iep">
 <SOAP-ENV:Header/>
 <SOAP-ENV:Body>
     <Location_MsgObj>
         <eventId>${eventId.0}</eventId>
         <productId>${productId.0}</productId>
         <location>${location.0}</location>
     </Location_MsgObj>
 </SOAP-ENV:Body>
</SOAP-ENV:Envelope>

