driver-tests/iepse/usecases/RfidTheftDetection/jbi/test/RfidTheftDetection/payment.xml

<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/"
                   xmlns:xsi="http://www.w3.org/1999/XMLSchema-instance"
                   xmlns:xsd="http://www.w3.org/1999/XMLSchema"
                   xmlns="RfidTheftDetection_iep">
 <SOAP-ENV:Header/>
 <SOAP-ENV:Body>
     <Payment_MsgObj>
         <productId>${productId.0}</productId>
     </Payment_MsgObj>
 </SOAP-ENV:Body>
</SOAP-ENV:Envelope>